In [1]:
import numpy as np
np.linspace(0,5,15)

array([0.        , 0.35714286, 0.71428571, 1.07142857, 1.42857143,
       1.78571429, 2.14285714, 2.5       , 2.85714286, 3.21428571,
       3.57142857, 3.92857143, 4.28571429, 4.64285714, 5.        ])

In [2]:
np.logspace(0,3,4)

array([   1.,   10.,  100., 1000.])

In [12]:
import pandas as pd
cols=['name','age','height']
df=pd.DataFrame([["sourav",20,156],["sumit",18,123],["arghya",16,199],["toton",29,154],["suvam",16,265]],columns=cols)
df

     name  age  height
0  sourav   20     156
1   sumit   18     123
2  arghya   16     199
3   toton   29     154
4   suvam   16     265

In [13]:
df[df.age<20][["name","age"]]

     name  age
1   sumit   18
2  arghya   16
4   suvam   16